Tekla Open API Reference for Tekla Structures 2025
SymbolElement.Symbol Property
 The symbol.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SymbolInfo Symbol { get; set; }
Public Property Symbol As SymbolInfo
	Get
	Set
Property Value
Type: SymbolInfo
See Also
Reference
SymbolElement Class
Tekla.Structures.Drawing Namespace